---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.CableTrayConduitBase
source: html/737daadd-93b5-a2a7-8982-933daf955285.htm
---
# CableTrayConduitBase Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.